benchmark/k6/results/OnPrem_LoadTest_MediumPL_2025-02-25T18:23:47.log
Execution Setup
{
  "testName": "OnPrem_LoadTest_SmallPL",
  "host": "192.168.1.182",
  "options": {
    "insecureSkipTLSVerify": true,
    "stages": [
      {
        "duration": "2m",
        "target": 350
      },
      {
        "duration": "1m",
        "target": 350
      },
      {
        "duration": "2m",
        "target": 0
      }
    ]
  },
  "multiplier": 1,
  "text": "In an era defined by rapid innovation and global interconnectivity, humanity finds itself at the crossroads of technology and tradition. Modern advancements in computing, medicine, and environmental science have redefined possibilities, enabling breakthroughs once thought impossible. As digital networks weave communities together, ethical debates and sustainable practices emerge as critical priorities. Scholars, engineers, and policymakers collaborate to harness artificial intelligence and renewable energy, ensuring progress benefits society at large. Cultural heritage and scientific discovery now coexist in a delicate balance, challenging us to honor the past while forging new paths. Every discovery, from quantum computing to gene editing, invites both excitement and caution, urging responsible innovation and shared wisdom for a brighter future. With each milestone, the narrative of progress deepens, inspiring a commitment to knowledge, empathy, and perseverance that transcends borders and generations. This comprehensive journey through scientific and cultural evolution illustrates how collective effort and visionary thinking drive society forward. The integration of diverse perspectives fosters innovation, while respect for natural systems ensures that progress remains sustainable and inclusive. As challenges arise and new opportunities emerge, the interplay between technology and human values continues to shape our shared destiny, reminding us that every step forward is a testament to our capacity for adaptation and hope.",
  "sleep": 0
}

----------------------------------------

Running gRPC Auto Migration via Framework...
         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 
     execution: local
        script: grpc-auto-test.js
        output: -
     scenarios: (100.00%) 1 scenario, 350 max VUs, 5m30s max duration (incl. graceful stop):
              * default: Up to 350 looping VUs for 5m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)
     ✓ status is OK
     checks...............: 100.00% 30660 out of 30660
     data_received........: 481 MB  1.6 MB/s
     data_sent............: 57 MB   191 kB/s
     grpc_req_duration....: avg=1.11s min=14.15ms med=981.88ms max=18.41s p(90)=1.77s p(95)=2.82s
     iteration_duration...: avg=2.06s min=29.17ms med=2.02s    max=21.53s p(90)=3.35s p(95)=4.49s
     iterations...........: 30660   102.194232/s
     vus..................: 1       min=1              max=350
     vus_max..............: 350     min=350            max=350
----------------------------------------

Running gRPC Manual Migration...
         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 
     execution: local
        script: grpc-manual-test.js
        output: -
     scenarios: (100.00%) 1 scenario, 350 max VUs, 5m30s max duration (incl. graceful stop):
              * default: Up to 350 looping VUs for 5m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)
     ✓ status is OK
     checks...............: 100.00% 30509 out of 30509
     data_received........: 479 MB  1.6 MB/s
     data_sent............: 57 MB   189 kB/s
     grpc_req_duration....: avg=1.11s min=11.47ms med=996.79ms max=27.71s p(90)=1.74s p(95)=2.73s
     iteration_duration...: avg=2.07s min=20.03ms med=2.03s    max=28.81s p(90)=3.35s p(95)=4.45s
     iterations...........: 30509   101.685186/s
     vus..................: 1       min=1              max=350
     vus_max..............: 350     min=350            max=350
----------------------------------------

Running HTTP REST Existing API...
         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 
     execution: local
        script: http-test.js
        output: -
     scenarios: (100.00%) 1 scenario, 350 max VUs, 5m30s max duration (incl. graceful stop):
              * default: Up to 350 looping VUs for 5m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)
     ✓ status is 200
     checks.........................: 100.00% 42134 out of 42134
     data_received..................: 661 MB  2.2 MB/s
     data_sent......................: 73 MB   243 kB/s
     http_req_blocked...............: avg=10.55ms  min=459ns   med=2.47µs   max=2.88s    p(90)=3.71µs  p(95)=4.47µs 
     http_req_connecting............: avg=10.55ms  min=0s      med=0s       max=2.88s    p(90)=0s      p(95)=0s     
     http_req_duration..............: avg=1.49s    min=10.17ms med=815.72ms max=27.67s   p(90)=3.77s   p(95)=6.13s  
       { expected_response:true }...: avg=1.49s    min=10.17ms med=815.72ms max=27.67s   p(90)=3.77s   p(95)=6.13s  
     http_req_failed................: 0.00%   0 out of 42134
     http_req_receiving.............: avg=546.93ms min=17.26µs med=17.8ms   max=23.77s   p(90)=1.61s   p(95)=3.35s  
     http_req_sending...............: avg=12.31µs  min=2.2µs   med=10.89µs  max=297.93µs p(90)=17.42µs p(95)=20.63µs
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s       max=0s       p(90)=0s      p(95)=0s     
     http_req_waiting...............: avg=948.9ms  min=6.44ms  med=761.66ms max=18.79s   p(90)=1.41s   p(95)=3.13s  
     http_reqs......................: 42134   140.44077/s
     iteration_duration.............: avg=1.5s     min=10.28ms med=816.44ms max=27.67s   p(90)=3.78s   p(95)=6.15s  
     iterations.....................: 42134   140.44077/s
     vus............................: 1       min=1              max=350
     vus_max........................: 350     min=350            max=350
----------------------------------------

All tests completed. See 'results/OnPrem_LoadTest_MediumPL_2025-02-25T18:23:47.log' for details.