benchmark/k6/results/OnPrem_LoadTest_MediumPL_2025-02-25T18:51:17.log
Execution Setup
{
  "testName": "OnPrem_LoadTest_MediumPL",
  "host": "192.168.1.182",
  "options": {
    "insecureSkipTLSVerify": true,
    "stages": [
      {
        "duration": "2m",
        "target": 350
      },
      {
        "duration": "1m",
        "target": 350
      },
      {
        "duration": "2m",
        "target": 0
      }
    ]
  },
  "multiplier": 10,
  "text": "In an era defined by rapid innovation and global interconnectivity, humanity finds itself at the crossroads of technology and tradition. Modern advancements in computing, medicine, and environmental science have redefined possibilities, enabling breakthroughs once thought impossible. As digital networks weave communities together, ethical debates and sustainable practices emerge as critical priorities. Scholars, engineers, and policymakers collaborate to harness artificial intelligence and renewable energy, ensuring progress benefits society at large. Cultural heritage and scientific discovery now coexist in a delicate balance, challenging us to honor the past while forging new paths. Every discovery, from quantum computing to gene editing, invites both excitement and caution, urging responsible innovation and shared wisdom for a brighter future. With each milestone, the narrative of progress deepens, inspiring a commitment to knowledge, empathy, and perseverance that transcends borders and generations. This comprehensive journey through scientific and cultural evolution illustrates how collective effort and visionary thinking drive society forward. The integration of diverse perspectives fosters innovation, while respect for natural systems ensures that progress remains sustainable and inclusive. As challenges arise and new opportunities emerge, the interplay between technology and human values continues to shape our shared destiny, reminding us that every step forward is a testament to our capacity for adaptation and hope.",
  "sleep": 0
}

----------------------------------------

Running gRPC Auto Migration via Framework...
         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 
     execution: local
        script: grpc-auto-test.js
        output: -
     scenarios: (100.00%) 1 scenario, 350 max VUs, 5m30s max duration (incl. graceful stop):
              * default: Up to 350 looping VUs for 5m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)
     ✓ status is OK
     checks...............: 100.00% 26149 out of 26149
     data_received........: 411 MB  1.4 MB/s
     data_sent............: 49 MB   163 kB/s
     grpc_req_duration....: avg=1.36s min=13.56ms med=1.04s max=32.83s p(90)=2.53s p(95)=4.03s
     iteration_duration...: avg=2.42s min=25.35ms med=2.13s max=41.27s p(90)=4.27s p(95)=5.92s
     iterations...........: 26149   87.122418/s
     vus..................: 2       min=2              max=350
     vus_max..............: 350     min=350            max=350
----------------------------------------

Running gRPC Manual Migration...
         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 
     execution: local
        script: grpc-manual-test.js
        output: -
     scenarios: (100.00%) 1 scenario, 350 max VUs, 5m30s max duration (incl. graceful stop):
              * default: Up to 350 looping VUs for 5m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)
     ✓ status is OK
     checks...............: 100.00% 30439 out of 30439
     data_received........: 478 MB  1.6 MB/s
     data_sent............: 57 MB   188 kB/s
     grpc_req_duration....: avg=1.11s min=13.15ms med=975.03ms max=19.78s p(90)=1.77s p(95)=2.82s
     iteration_duration...: avg=2.08s min=24.41ms med=2.06s    max=22.81s p(90)=3.38s p(95)=4.45s
     iterations...........: 30439   101.451569/s
     vus..................: 1       min=1              max=350
     vus_max..............: 350     min=350            max=350
----------------------------------------

Running HTTP REST Existing API...
         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 
     execution: local
        script: http-test.js
        output: -
     scenarios: (100.00%) 1 scenario, 350 max VUs, 5m30s max duration (incl. graceful stop):
              * default: Up to 350 looping VUs for 5m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)
     ✓ status is 200
     checks.........................: 100.00% 45046 out of 45046
     data_received..................: 706 MB  2.4 MB/s
     data_sent......................: 78 MB   259 kB/s
     http_req_blocked...............: avg=9.61ms   min=508ns   med=2.4µs    max=2.82s  p(90)=3.5µs   p(95)=4.21µs 
     http_req_connecting............: avg=9.61ms   min=0s      med=0s       max=2.82s  p(90)=0s      p(95)=0s     
     http_req_duration..............: avg=1.39s    min=9.36ms  med=773.82ms max=42.63s p(90)=3.42s   p(95)=5.53s  
       { expected_response:true }...: avg=1.39s    min=9.36ms  med=773.82ms max=42.63s p(90)=3.42s   p(95)=5.53s  
     http_req_failed................: 0.00%   0 out of 45046
     http_req_receiving.............: avg=532.63ms min=22.05µs med=19.93ms  max=36.42s p(90)=1.57s   p(95)=3.12s  
     http_req_sending...............: avg=11.72µs  min=2.27µs  med=10.31µs  max=1.82ms p(90)=16.28µs p(95)=19.58µs
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s       max=0s     p(90)=0s      p(95)=0s     
     http_req_waiting...............: avg=865.77ms min=6.11ms  med=720.04ms max=35.41s p(90)=1.18s   p(95)=2.8s   
     http_reqs......................: 45046   150.150926/s
     iteration_duration.............: avg=1.4s     min=9.51ms  med=774.49ms max=42.63s p(90)=3.45s   p(95)=5.53s  
     iterations.....................: 45046   150.150926/s
     vus............................: 1       min=1              max=350
     vus_max........................: 350     min=350            max=350
----------------------------------------

All tests completed. See 'results/OnPrem_LoadTest_MediumPL_2025-02-25T18:51:17.log' for details.